#!/usr/bin/env python
# coding: utf-8

# In[89]:


import collections

with open('verni_im_dengi_pidor.txt', 'r') as f:
    text = f.read().lower()

exclude_words = {"и", "в", "а", "но", "он", "она", "мы", "они", "что", "это", "вот", "как", "не", "на", "с", "да,", "ну,", "все", "то", "у", "есть", "так", "бы", "к", "его", "если", "по", "из", "еще", "потому", "там", "ты", "ну", "за", "очень", "было", "от", "же", "их", "про", "о", "уже", "да.", "когда", "просто", "тоже", "даже", "только", "или", "чтобы", "вообще", "мне", "был", "для", "этот", "до", "ее", "него", "сейчас", "может", "вы", "меня", "этом", "кстати,", "ли", "то,", "этого", "чем", "ему", "где", "была", "всё", "который", "её", "потом", "были", "со", "себя", "самом", "что-то", "ничего", "которые", "много", "об", "можно", "после", "этой", "них", "нет,", "и,", "больше", "такой", "ещё", "ей", "неё", "им", "того,", "тут", "кто", "эти", "тогда", "ни", "вам", "при", "которая", "общем,", "нас", "во", "раз", "под", "своей", "быть", "тот", "—", "поэтому", "будет", "нет.", "такое", "том,", "свою", "конечно,", "это,", "именно", "джао", "мог", "например,", "всего", "естественно,", "эту", "всегда", "всех", "несколько", "какой-то", "всем", "ним", "себе", "никогда", "один", "такая", "почему", "так,", "без", "есть,", "что,", "энтони", "эрин", "элис", "же,", "надо", "тебя", "мора", "нужно", "тем", "там,", "джек", "вот,", "знаю,", "эта", "люди", "теперь", "кто-то", "бы,", "диди", "быть,", "да?", "нам", "авраам", "из-за", "два", "все,", "такие", "типа", "типа,", "никто", "пока", "как-то", "короче,", "этих", "вас", "лет", "какие-то", "собственно,", "своих", "ладно,", "вот.", "более", "года", "ней", "момент", "нее", "прям", "своего", "значит,", "сразу", "но,", "стал", "опять", "сказал,", "нет", "человек", "другой", "да", "также", "году", "здесь", "совсем", "действительно", "сам", "над", "этому", "свои", "наш", "стала", "несмотря", "кроме", "скорее", "а,", "он,", "прямо", "хотя", "тебе", "получается,", "этим", "которую", "своим", "подкаст", "сильно", "снова", "друг", "так.", "сегодня", "вместе", "будто", "одной", "свой", "часто", "примерно", "хотел", "всю", "сначала", "том", "сказать,", "почти", "было.", "таких", "–", "лет.", "конечно", "совершенно", "равно", "три", "особенно", "какая-то", "говорит,", "которых", "могла", "новый", "сказала", "одна", "сказала,", "всего", "всего,", "чего", "каждый", "либо", "перед", "людей", "самое", "чуть", "тем,", "сделать", "тысяч", "которой", "куда", "выпуск", "стали", "вроде", "таким", "часть", "начал", "конечно.", "первый", "говоря,", "человек,", "довольно", "точно", "делать", "вдруг", "плюс", "целом", "спасибо", "принципе", "все-таки", "принципе,", "насколько"}

word_freq = collections.Counter(word for word in text.split() if word not in exclude_words)

for word, freq in word_freq.most_common(25):
    print(f"{word}: {freq}")

